<template>
    <div class="container_notice">
		<v-journalism-lists @detailsBtn="detailsBtn" :hostArray="hostArray"></v-journalism-lists>
    </div>
</template>
<script>
export default {
	data() {
		return {
			hostArray: [
				{
					day: "23",
					addtime: "2019-9",
					title: "关于用人单位招聘我校毕业生、到我校举办宣讲会的流程公告",
					remarks:
					"具有服务基层项目工作经历的大学毕业生，符合选调条件的可报考1次选调生主要包括2019年服务期满且考核合格的天津市“三支一扶”大学生（以下简称“三支一扶”大学生）和2019年服"
				},
				{
					day: "24",
					addtime: "2019-9",
					title: "关于用人单位招聘我校毕业生、到我校举办宣讲会的流程公告",
					remarks:
					"具有服务基层项目工作经历的大学毕业生，符合选调条件的可报考1次选调生主要包括2019年服务期满且考核合格的天津市“三支一扶”大学生（以下简称“三支一扶”大学生）和2019年服"
				},
				{
					day: "25",
					addtime: "2019-9",
					title: "关于用人单位招聘我校毕业生、到我校举办宣讲会的流程公告",
					remarks:
					"具有服务基层项目工作经历的大学毕业生，符合选调条件的可报考1次选调生主要包括2019年服务期满且考核合格的天津市“三支一扶”大学生（以下简称“三支一扶”大学生）和2019年服"
				},
				{
					day: "23",
					addtime: "2019-9",
					title: "关于用人单位招聘我校毕业生、到我校举办宣讲会的流程公告",
					remarks:
					"具有服务基层项目工作经历的大学毕业生，符合选调条件的可报考1次选调生主要包括2019年服务期满且考核合格的天津市“三支一扶”大学生（以下简称“三支一扶”大学生）和2019年服"
				},
				{
					day: "24",
					addtime: "2019-9",
					title: "关于用人单位招聘我校毕业生、到我校举办宣讲会的流程公告",
					remarks:
					"具有服务基层项目工作经历的大学毕业生，符合选调条件的可报考1次选调生主要包括2019年服务期满且考核合格的天津市“三支一扶”大学生（以下简称“三支一扶”大学生）和2019年服"
				},
				{
					day: "25",
					addtime: "2019-9",
					title: "关于用人单位招聘我校毕业生、到我校举办宣讲会的流程公告",
					remarks:
					"具有服务基层项目工作经历的大学毕业生，符合选调条件的可报考1次选调生主要包括2019年服务期满且考核合格的天津市“三支一扶”大学生（以下简称“三支一扶”大学生）和2019年服"
				},
				{
					day: "23",
					addtime: "2019-9",
					title: "关于用人单位招聘我校毕业生、到我校举办宣讲会的流程公告",
					remarks:
					"具有服务基层项目工作经历的大学毕业生，符合选调条件的可报考1次选调生主要包括2019年服务期满且考核合格的天津市“三支一扶”大学生（以下简称“三支一扶”大学生）和2019年服"
				},
				{
					day: "24",
					addtime: "2019-9",
					title: "关于用人单位招聘我校毕业生、到我校举办宣讲会的流程公告",
					remarks:
					"具有服务基层项目工作经历的大学毕业生，符合选调条件的可报考1次选调生主要包括2019年服务期满且考核合格的天津市“三支一扶”大学生（以下简称“三支一扶”大学生）和2019年服"
				},
				{
					day: "25",
					addtime: "2019-9",
					title: "关于用人单位招聘我校毕业生、到我校举办宣讲会的流程公告",
					remarks:
					"具有服务基层项目工作经历的大学毕业生，符合选调条件的可报考1次选调生主要包括2019年服务期满且考核合格的天津市“三支一扶”大学生（以下简称“三支一扶”大学生）和2019年服"
				}
			]
		};
	},
	methods: {
		detailsBtn() {
			this.$router.push("/user/collection/noticeDetail");
		}
	}
};
</script>
<style lang="scss" scoped>
.container_notice {
	/deep/.announcement {
		margin-top: 20px;
		/deep/ .announcement-right {
			border-bottom: none;
		}
	}
}
</style>